In [1]:
#decision trees

In [2]:
import numpy as np

In [58]:
#def entropy(p,q):
    return -p*np.log2(p)-q*np.log2(q)

IndentationError: unexpected indent (<ipython-input-58-e3ef785132fb>, line 2)

In [59]:
(7*entropy(3/7,4/7)+7*entropy(6/7,1/7))/14

TypeError: entropy() takes 1 positional argument but 2 were given

In [60]:
outlook=0.94-0.69
print(outlook)

0.25

In [61]:
temp=0.94-.9110633930116763
print(temp)

0.028936606988323677

In [62]:
humidity=0.940-.7884504573082894
print(humidity)

0.1515495426917105

In [63]:
import pandas as pd

In [64]:
data=pd.read_csv("titanic.csv")a

SyntaxError: invalid syntax (<ipython-input-64-7ebc856d59e6>, line 1)

In [65]:
data.shape

(891, 12)

In [66]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [67]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [68]:
not_usseful=['PassengerId','Name','Ticket','Cabin','Embarked']

In [69]:
data_clean=data.drop(columns=not_usseful)

In [70]:
data_clean.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [71]:
from sklearn.preprocessing import LabelEncoder

In [72]:
le=LabelEncoder()
temp=["A","B","C","B","A"]
le.fit_transform(temp)

array([0, 1, 2, 1, 0], dtype=int32)

In [73]:
data_clean['Sex']=le.fit_transform(data_clean['Sex'])

In [74]:
data_clean.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

In [75]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int32
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
dtypes: float64(2), int32(1), int64(4)
memory usage: 45.3 KB

In [76]:
data_clean.describe()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,0.647587,29.699118,0.523008,0.381594,32.204208
std,0.486592,0.836071,0.477990,14.526497,1.102743,0.806057,49.693429
min,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000
25%,0.000000,2.000000,0.000000,20.125000,0.000000,0.000000,7.910400
50%,0.000000,3.000000,1.000000,28.000000,0.000000,0.000000,14.454200
75%,1.000000,3.000000,1.000000,38.000000,1.000000,0.000000,31.000000
max,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200

In [77]:
data_clean=data_clean.fillna(data_clean['Age'].mean())
##to fill empty values

In [78]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int32
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
dtypes: float64(2), int32(1), int64(4)
memory usage: 45.3 KB

In [116]:
def entropy(column):
    counts=np.unique(column,return_counts=True)
    ent=0.0
    N=float(column.shape[0])
    for i in counts[1]:
        p=i/N
        ent+=-(p*np.log2(p))
    return ent

In [117]:
def split_data(X_data,fkey,fval):
    #binary split
    X_right=pd.DataFrame([],columns=X_data.columns)
    X_left=pd.DataFrame([],columns=X_data.columns)
    
    for ix in range(X_data.shape[0]):
        val=X_data[fkey].loc[ix]
        
        if val>fval:
            X_right=X_right.append(X_data.loc[ix])
        else:
            X_left=X_left.append(X_data.loc[ix])
    return X_right,X_left

In [118]:
R,L=split_data(data_clean,"Sex",0.5)
R.head()

   Survived  Pclass  Sex        Age  SibSp  Parch     Fare
0       0.0     3.0  1.0  22.000000    1.0    0.0   7.2500
4       0.0     3.0  1.0  35.000000    0.0    0.0   8.0500
5       0.0     3.0  1.0  29.699118    0.0    0.0   8.4583
6       0.0     1.0  1.0  54.000000    0.0    0.0  51.8625
7       0.0     3.0  1.0   2.000000    3.0    1.0  21.0750

In [121]:
def info_gain(X_data,fkey,fval):
    right,left=split_data(X_data,fkey,fval)
    l=float(left.shape[0]/X_data.shape[0])
    r=float(right.shape[0]/X_data.shape[0])
    
    if left.shape[0]==0 or right.shape[0]==0:
        return -10000
    i_gain=entropy(X_data.Survived)-l*entropy(left.Survived)-r*entropy(right.Survived)
    return i_gain

In [124]:
info_gain(data_clean,'Sex',0.5)

0.2176601066606143

In [127]:
X=data_clean[["Pclass",'Sex','Age','SibSp','Parch','Fare']]

In [128]:
Y=data_clean[['Survived']]

In [129]:
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    1  22.0      1      0   7.2500
1       1    0  38.0      1      0  71.2833
2       3    0  26.0      0      0   7.9250
3       1    0  35.0      1      0  53.1000
4       3    1  35.0      0      0   8.0500

In [130]:
for f in X.columns:
    print(f)
    print(info_gain(data_clean,f,data_clean[f].mean()))

Pclass
0.07579362743608165
Sex
0.2176601066606143
Age
0.0008836151229467681
SibSp
0.009584541813400127
Parch
0.015380754493137666
Fare
0.04214069283899541

In [ ]:
class Decison Tree:
    def _init_(self,depth=0,max_depth=5):
        self.left=None
        self.right=None
        self.fkey=None
        self.fval= None
        self.max_depth=max_depth
        self.depth=depth
        self.target=None
        
    def train(self,X_train):
        features=['Pclass','Sex','Age','Sibsp','Parch','Fare']
        info_gain=[]
        
        for i in features:
            i_gain=info.gain(X_train,i,X_train[i].mean())
            info_gain.append(i_gain)
            
        selected=features[np.argmin(info_gain)]
        self.fkey=selected
        self.fval=X_train[selected].mean()
        
        data_left,data_right=split_data(X_train,self.fkey,self.fval)
        data_left=data_left.reset_index(drop=True)
        data_right=data_right.reset_index(drop=True)
        
        if(data_left.shape[0]==0 or data_right.shape[0]==0)